/*
Организована система считывания вообще любых параметров из любых
устройств на шине, а не только температур из двигателей.

Идея в следующем: Зубр-контроллер для каждого канала (шины) помимо
реальных устройств шины содержит еще одно специальное устройство,
способное подключаться к любому из устройств на шине. Эта система
была предназначена для возможности смотреть и изменять параметры двигателей
и других устройств через IronArt.

Теперь эта система задействована в обычной работе Зубр-контроллера.
Добавлены три функции, которые позволяют сформировать запрос к устройству
на шине и получить от него ответ. Напрямую эти функции применять не нужно,
поскольку в общении через них нужно соблюдать определенную последовательность.

Вместо этого в файле Sv8sys.h сделана функция, которая внутри учитывает
все нужные аспекты и позволяет за один раз считать один параметр из любого
устройства на шине. Это функция sfUnitParamRead.
В качестве параметров ей передается индекс устройства, номер параметра и адрес
переменной, в которую нужно записать результат.
Также функция возвращает флаг: 1 - когда чтение выполнено успешно или 0 - когда
при чтении возникла ошибка. Важно! Если возникает ошибка, то значение ранее находившееся
в переменной результата не портится.
Ошибка может возникать из-за неверных параметров, например неверного индекса устройства или
когда устройство с заданным индексом отсутствует на шине или когда возникла ошибка обмена.

Функция sfUnitParamRead тормозит выполнение своего потока на 2 фрейма. Поэтому целесообразно
размещать все операции чтения параметров в отдельном потоке, чтобы чтения параметров не
мешали выполнению основного потока.

Исходя из этого, нужно понимать, что указанное чтение параметров - медленная операция, особенно
когда нужно опросить все 30 движков, однако, это не должно быть проблемой, поскольку с помощью
этого механизма предполагается чтение, например, температур или суммы токов.

Также для таких вещей не должно быть проблемой периодическая ошибка считывания. Актуальное значение
обновится на следующей итерации цикла считывания.
*/
#include <roki4Gibon.h>


int pos;
int current;
int ntc;
int ntcLim;

void paramScan() {
  while(1) {
    sfUnitParamRead( IDX_LEFT_SHOULDER, 14, &pos );
    sfUnitParamRead( IDX_LEFT_SHOULDER, 200, &current );
    sfUnitParamRead( IDX_LEFT_SHOULDER, 201, &ntc );
    sfUnitParamRead( IDX_LEFT_SHOULDER, 205, &ntcLim );
    }
  }

//void main() {
//  sfCreateTask( paramScan, 20 );
//  while(1)
//    sfWaitNextFrame();
//  }


void main() {
  //Переназначаем кнопку на хотьбу
  //svButtonRight = sfSlotIndex("roki3AWalk.cpp");
//  sfAccumSetup4( &svDebug0, &svDebug1, &svDebug1, &svDebug1 );
//  sfAccumTrigger();
  svNNControlX = 0;
  svNNControlY = 0;
  svNNControlT = 0;
  //Переводим все сервы в 0
  sfPoseGroup( MASK_ALL, 0, 100 );
  sfWaitFrame( 200 );
  sfStop();
  }
